app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("full_name", "email", "birthday", "identification_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["full_name", "teste"], ["email", "alo"], ["birthday", nil], ["identification_code", nil], ["created_at", "2023-05-28 01:28:55.120622"], ["updated_at", "2023-05-28 01:28:55.120622"]]